{"class_name": "Functional", "config": {"name": "model_11", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "bn_data", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_170", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d_170", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv0", "inbound_nodes": [[["zero_padding2d_170", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_171", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_171", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling0", "inbound_nodes": [[["zero_padding2d_171", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_172", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_172", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_172", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_173", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_173", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_173", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_sc", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_80", "trainable": true, "dtype": "float32"}, "name": "add_80", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn1", "inbound_nodes": [[["add_80", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_174", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_174", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_174", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_175", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_175", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_175", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_81", "trainable": true, "dtype": "float32"}, "name": "add_81", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add_80", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit3_bn1", "inbound_nodes": [[["add_81", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit3_relu1", "inbound_nodes": [[["stage1_unit3_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_176", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_176", "inbound_nodes": [[["stage1_unit3_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit3_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit3_conv1", "inbound_nodes": [[["zero_padding2d_176", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit3_bn2", "inbound_nodes": [[["stage1_unit3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit3_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit3_relu2", "inbound_nodes": [[["stage1_unit3_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_177", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_177", "inbound_nodes": [[["stage1_unit3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit3_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit3_conv2", "inbound_nodes": [[["zero_padding2d_177", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_82", "trainable": true, "dtype": "float32"}, "name": "add_82", "inbound_nodes": [[["stage1_unit3_conv2", 0, 0, {}], ["add_81", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn1", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_178", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_178", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_178", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_179", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_179", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_179", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_sc", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_83", "trainable": true, "dtype": "float32"}, "name": "add_83", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn1", "inbound_nodes": [[["add_83", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_180", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_180", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_180", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_181", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_181", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_181", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_84", "trainable": true, "dtype": "float32"}, "name": "add_84", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_83", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit3_bn1", "inbound_nodes": [[["add_84", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit3_relu1", "inbound_nodes": [[["stage2_unit3_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_182", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_182", "inbound_nodes": [[["stage2_unit3_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit3_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit3_conv1", "inbound_nodes": [[["zero_padding2d_182", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit3_bn2", "inbound_nodes": [[["stage2_unit3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit3_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit3_relu2", "inbound_nodes": [[["stage2_unit3_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_183", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_183", "inbound_nodes": [[["stage2_unit3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit3_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit3_conv2", "inbound_nodes": [[["zero_padding2d_183", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_85", "trainable": true, "dtype": "float32"}, "name": "add_85", "inbound_nodes": [[["stage2_unit3_conv2", 0, 0, {}], ["add_84", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit4_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit4_bn1", "inbound_nodes": [[["add_85", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit4_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit4_relu1", "inbound_nodes": [[["stage2_unit4_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_184", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_184", "inbound_nodes": [[["stage2_unit4_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit4_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit4_conv1", "inbound_nodes": [[["zero_padding2d_184", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit4_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit4_bn2", "inbound_nodes": [[["stage2_unit4_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit4_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit4_relu2", "inbound_nodes": [[["stage2_unit4_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_185", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_185", "inbound_nodes": [[["stage2_unit4_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit4_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit4_conv2", "inbound_nodes": [[["zero_padding2d_185", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_86", "trainable": true, "dtype": "float32"}, "name": "add_86", "inbound_nodes": [[["stage2_unit4_conv2", 0, 0, {}], ["add_85", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn1", "inbound_nodes": [[["add_86", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_186", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_186", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_186", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_187", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_187", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_187", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_sc", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_87", "trainable": true, "dtype": "float32"}, "name": "add_87", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn1", "inbound_nodes": [[["add_87", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_188", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_188", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_188", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_189", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_189", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_189", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_88", "trainable": true, "dtype": "float32"}, "name": "add_88", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_87", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit3_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit3_bn1", "inbound_nodes": [[["add_88", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit3_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit3_relu1", "inbound_nodes": [[["stage3_unit3_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_190", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_190", "inbound_nodes": [[["stage3_unit3_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit3_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit3_conv1", "inbound_nodes": [[["zero_padding2d_190", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit3_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit3_bn2", "inbound_nodes": [[["stage3_unit3_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit3_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit3_relu2", "inbound_nodes": [[["stage3_unit3_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_191", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_191", "inbound_nodes": [[["stage3_unit3_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit3_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit3_conv2", "inbound_nodes": [[["zero_padding2d_191", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_89", "trainable": true, "dtype": "float32"}, "name": "add_89", "inbound_nodes": [[["stage3_unit3_conv2", 0, 0, {}], ["add_88", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit4_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit4_bn1", "inbound_nodes": [[["add_89", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit4_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit4_relu1", "inbound_nodes": [[["stage3_unit4_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_192", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_192", "inbound_nodes": [[["stage3_unit4_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit4_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit4_conv1", "inbound_nodes": [[["zero_padding2d_192", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit4_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit4_bn2", "inbound_nodes": [[["stage3_unit4_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit4_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit4_relu2", "inbound_nodes": [[["stage3_unit4_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_193", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_193", "inbound_nodes": [[["stage3_unit4_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit4_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit4_conv2", "inbound_nodes": [[["zero_padding2d_193", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_90", "trainable": true, "dtype": "float32"}, "name": "add_90", "inbound_nodes": [[["stage3_unit4_conv2", 0, 0, {}], ["add_89", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit5_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit5_bn1", "inbound_nodes": [[["add_90", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit5_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit5_relu1", "inbound_nodes": [[["stage3_unit5_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_194", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_194", "inbound_nodes": [[["stage3_unit5_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit5_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit5_conv1", "inbound_nodes": [[["zero_padding2d_194", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit5_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit5_bn2", "inbound_nodes": [[["stage3_unit5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit5_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit5_relu2", "inbound_nodes": [[["stage3_unit5_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_195", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_195", "inbound_nodes": [[["stage3_unit5_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit5_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit5_conv2", "inbound_nodes": [[["zero_padding2d_195", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_91", "trainable": true, "dtype": "float32"}, "name": "add_91", "inbound_nodes": [[["stage3_unit5_conv2", 0, 0, {}], ["add_90", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit6_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, 